def z1():
    def A():
        for ct, cap in c.items():
            print( f'Страна: {ct} , Столица: {cap}')

    def B():
        n = input('Введите страну: ')
        for ct, cap in c.items():
            if n == ct:
                print(f'Столица {n} это {cap}')

    def C():
        return sorted(c)

    c = {
        "Россия": "Москва",
        "Польша": "Варшава",
        "Австрия": "Вена",
        "Германия": "Берлин",
        "Монако": "Монако"
    }

    task = int(input("Введите столицу из задания: "))
    if task == 1:
        print(A())
    if task == 2:
        print(B())
    elif task == 3:
        print(C())
z1()

def z2():
    k = 0
    c1 = {'А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т', 'а', 'в', 'е', 'и', 'н', 'о', 'р', 'с', 'т'}
    c2 = {'Д', 'К', 'Л', 'М', 'П', 'У', 'д', 'к', 'л', 'м', 'п', 'у'}
    c3 = {'Б', 'Г', 'Ё', 'Ь', 'Я', 'б', 'г', 'ё', 'ь', 'я'}
    c4 = {'Й', 'Ы' ,'й', 'ы'}
    c5 = {'Ж', 'З', 'Х', 'Ц', 'Ч', 'ж', 'з', 'х', 'ц', 'ч'}
    c8 = {'Ш', 'Э', 'Ю', 'ш', 'э', 'ю'}
    c10 = {'Ф', 'Щ', 'Ъ', 'ф', 'щ', 'ъ'}
    n = input('Введите ваше слово: ')
    for c in n:
        if c in c1:
            k += 1
        if c in c2:
            k += 2
        if c in c3:
            k += 3
        if c in c4:
            k += 4
        if c in c5:
            k += 5
        if c in c8:
            k += 8
        if c in c10:
            k += 10
    print("Ваши баллы", k)
z2()

